### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_key_vault_secret.redis_access_key_itn will be created
  + resource "azurerm_key_vault_secret" "redis_access_key_itn" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-auth-kv-01"
      + name                    = "redis-access-key-itn"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.function_lv.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "5"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "5"
          - "FAST_LOGIN_AUDIT_CONNECTION_STRING"                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/audit-st-connection-string)"
          - "FAST_LOGIN_AUDIT_CONTAINER_NAME"                                                                  = "lv-logs-01"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "8"
          - "LOLLIPOP_GET_ASSERTION_API_KEY"                                                                   = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/fast-login-subscription-key)"
          - "LOLLIPOP_GET_ASSERTION_BASE_URL"                                                                  = "https://api-internal.io.italia.it"
          - "NODE_ENV"                                                                                         = "production"
          - "REDIS_PASSWORD"                                                                                   = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/redis-access-key)"
          - "REDIS_PORT"                                                                                       = "6380"
          - "REDIS_URL"                                                                                        = "io-p-itn-citizen-auth-redis-std-v6.redis.cache.windows.net"
          - "SESSION_MANAGER_INTERNAL_API_KEY"                                                                 = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/fast-login-session-manager-internal-key)"
          - "SESSION_MANAGER_INTERNAL_BASE_URL"                                                                = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
          - "SLOT_TASK_HUBNAME"                                                                                = "ProductionTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02"
        name                                           = "io-p-itn-auth-lv-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_lv.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          - "APPINSIGHTS_SAMPLING_PERCENTAGE"                                                                  = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage" = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__maxSamplingPercentage"     = "100"
          - "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__minSamplingPercentage"     = "100"
          - "FAST_LOGIN_AUDIT_CONNECTION_STRING"                                                               = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/audit-st-connection-string)"
          - "FAST_LOGIN_AUDIT_CONTAINER_NAME"                                                                  = "lv-logs-01"
          - "FETCH_KEEPALIVE_ENABLED"                                                                          = "true"
          - "FETCH_KEEPALIVE_FREE_SOCKET_TIMEOUT"                                                              = "30000"
          - "FETCH_KEEPALIVE_MAX_FREE_SOCKETS"                                                                 = "10"
          - "FETCH_KEEPALIVE_MAX_SOCKETS"                                                                      = "40"
          - "FETCH_KEEPALIVE_SOCKET_ACTIVE_TTL"                                                                = "110000"
          - "FETCH_KEEPALIVE_TIMEOUT"                                                                          = "60000"
          - "FUNCTIONS_WORKER_PROCESS_COUNT"                                                                   = "8"
          - "LOLLIPOP_GET_ASSERTION_API_KEY"                                                                   = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/fast-login-subscription-key)"
          - "LOLLIPOP_GET_ASSERTION_BASE_URL"                                                                  = "https://api-internal.io.italia.it"
          - "NODE_ENV"                                                                                         = "production"
          - "REDIS_PASSWORD"                                                                                   = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/redis-access-key)"
          - "REDIS_PORT"                                                                                       = "6380"
          - "REDIS_URL"                                                                                        = "io-p-itn-citizen-auth-redis-std-v6.redis.cache.windows.net"
          - "SESSION_MANAGER_INTERNAL_API_KEY"                                                                 = "@Microsoft.KeyVault(SecretUri=https://io-p-itn-auth-kv-01.vault.azure.net/secrets/fast-login-session-manager-internal-key)"
          - "SESSION_MANAGER_INTERNAL_BASE_URL"                                                                = "https://io-p-weu-auth-sm-int-func-01.azurewebsites.net"
          - "SLOT_TASK_HUBNAME"                                                                                = "StagingTaskHub"
          - "WEBSITE_ADD_SITENAME_BINDINGS_IN_APPHOST_CONFIG"                                                  = "1"
          - "WEBSITE_DNS_SERVER"                                                                               = "168.63.129.16"
          - "WEBSITE_RUN_FROM_PACKAGE"                                                                         = "1"
          - "WEBSITE_SWAP_WARMUP_PING_PATH"                                                                    = "/info"
          - "WEBSITE_SWAP_WARMUP_PING_STATUSES"                                                                = "200,204"
          - "WEBSITE_WARMUP_PATH"                                                                              = "/info"
        } -> (known after apply)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-lv-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-lv-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Auth&Identity"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>
